#include <arpa/inet.h>
#include <chrono>
#include "../../app_gen/hdr/app.hpp"
#include "../../lib/hdr/lib.hpp"

// Программа №1

// Должна состоять из двух потоков и одного общего буфера.

// Поток 1.  Принимает строку, которую введет пользователь. Должна быть проверка, что строка состоит только
// из цифр и не превышает 64 символа. После проверки строка передается на обработку функции 1. Затем
// обработанная строка помещается в общий буфер и поток должен ожидать дальнейшего ввода пользователя.

// Поток 2. Должен обрабатывать данные которые помещаются в общий буфер. После получения данных общий
// буфер затирается. Поток должен вывести полученные данные на экран, а также передать эти данные функции
// 2.  Значение, возвращенное функцией, передать в Программу №2. После этого поток ожидает следующие
// данные.

// Примечание №1 по Программе №1: Взаимодействие потоков должно быть синхронизировано, поток №2 не
// должен постоянно опрашивать общий буфер.

// Примечание №2 по Программе №1: Работа программы должна быть максимально независима от статуса
// запуска программы №2. Это значит, что внезапная остановка программы №2 не должна приводить к
// немедленным проблемам ввода у пользователя. При перезапуске программы №2 необходимо произвести
// передподключение.

class app1 : public app_gen{
	std::mutex mtx;
	std::condition_variable cv;
	bool buffer_status;

public:
	app1();

	void func_thread1();
	void func_thread2();

private:
	void error() noexcept;
};
